load_testing/results_for_report/long_comp/dyn_3_peaks_360s_10keys_400r.txt
 wrk -t2 --timeout 15s --latency -s longCompScript.lua -c200 -d360s -R400 http://172.31.11.13:3000
CONNECTED to addr       172.31.11.13:3000
CONNECTED to addr       172.31.10.136:3000
all addrs:
1       172.31.11.13:3000
2       172.31.10.136:3000
thread addr: 172.31.11.13:3000
all addrs:
1       172.31.11.13:3000
2       172.31.10.136:3000
thread addr: 172.31.10.136:3000
Running 6m test @ http://172.31.11.13:3000
  2 threads and 200 connections
  Thread calibration: mean lat.: 4.167ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.384ms, rate sampling interval: 11ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.53ms    4.66ms 334.59ms   97.00%
    Req/Sec   208.90     56.08   700.00     67.37%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.88ms
 75.000%    4.47ms
 90.000%    5.69ms
 99.000%   14.82ms
 99.900%   56.83ms
 99.990%  201.73ms
 99.999%  279.30ms
100.000%  334.85ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.499     0.000000            1         1.00
       3.189     0.100000        14078         1.11
       3.393     0.200000        28044         1.25
       3.563     0.300000        42071         1.43
       3.719     0.400000        55931         1.67
       3.875     0.500000        69931         2.00
       3.957     0.550000        76989         2.22
       4.045     0.600000        83901         2.50
       4.155     0.650000        90893         2.86
       4.291     0.700000        98014         3.33
       4.471     0.750000       104879         4.00
       4.587     0.775000       108439         4.44
       4.727     0.800000       111865         5.00
       4.907     0.825000       115353         5.71
       5.119     0.850000       118875         6.67
       5.363     0.875000       122336         8.00
       5.511     0.887500       124100         8.89
       5.687     0.900000       125840        10.00
       5.923     0.912500       127572        11.43
       6.267     0.925000       129325        13.33
       6.771     0.937500       131078        16.00
       7.103     0.943750       131940        17.78
       7.503     0.950000       132814        20.00
       7.943     0.956250       133690        22.86
       8.415     0.962500       134558        26.67
       9.063     0.968750       135433        32.00
       9.415     0.971875       135870        35.56
       9.863     0.975000       136306        40.00
      10.383     0.978125       136748        45.71
      11.087     0.981250       137185        53.33
      11.943     0.984375       137617        64.00
      12.463     0.985938       137836        71.11
      13.167     0.987500       138053        80.00
      14.103     0.989062       138271        91.43
      15.423     0.990625       138491       106.67
      16.991     0.992188       138709       128.00
      18.047     0.992969       138818       142.22
      19.167     0.993750       138927       160.00
      20.687     0.994531       139036       182.86
      22.639     0.995313       139145       213.33
      24.847     0.996094       139254       256.00
      26.319     0.996484       139310       284.44
      28.511     0.996875       139364       320.00
      31.327     0.997266       139419       365.71
      35.007     0.997656       139473       426.67
      39.807     0.998047       139527       512.00
      42.271     0.998242       139555       568.89
      45.535     0.998437       139582       640.00
      49.055     0.998633       139609       731.43
      53.343     0.998828       139637       853.33
      57.727     0.999023       139664      1024.00
      61.183     0.999121       139678      1137.78
      63.647     0.999219       139691      1280.00
      68.991     0.999316       139705      1462.86
      78.655     0.999414       139719      1706.67
      85.119     0.999512       139732      2048.00
      90.559     0.999561       139739      2275.56
      93.375     0.999609       139746      2560.00
     107.455     0.999658       139753      2925.71
     116.799     0.999707       139760      3413.33
     145.279     0.999756       139766      4096.00
     159.999     0.999780       139771      4551.11
     168.191     0.999805       139773      5120.00
     178.431     0.999829       139777      5851.43
     188.287     0.999854       139780      6826.67
     196.223     0.999878       139783      8192.00
     198.399     0.999890       139785      9102.22
     214.783     0.999902       139787     10240.00
     217.471     0.999915       139789     11702.86
     220.543     0.999927       139790     13653.33
     251.519     0.999939       139792     16384.00
     262.399     0.999945       139793     18204.44
     264.447     0.999951       139794     20480.00
     264.703     0.999957       139796     23405.71
     264.703     0.999963       139796     27306.67
     264.703     0.999969       139796     32768.00
     264.959     0.999973       139797     36408.89
     264.959     0.999976       139797     40960.00
     267.519     0.999979       139798     46811.43
     267.519     0.999982       139798     54613.33
     267.519     0.999985       139798     65536.00
     279.295     0.999986       139799     72817.78
     279.295     0.999988       139799     81920.00
     279.295     0.999989       139799     93622.86
     279.295     0.999991       139799    109226.67
     279.295     0.999992       139799    131072.00
     334.847     0.999993       139800    145635.56
     334.847     1.000000       139800          inf
#[Mean    =        4.534, StdDeviation   =        4.663]
#[Max     =      334.592, Total count    =       139800]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  144002 requests in 6.00m, 35.16MB read
Requests/sec:    400.00
Transfer/sec:    100.00KB
thread 0 made 72002 requests and got 72001 responses
thread 1 made 72001 requests and got 72001 responses
2022-06-07 02:51:03.274 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: NaN 
2022-06-07 02:51:08.271 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 2 
2022-06-07 02:51:13.268 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.855421686746988 
2022-06-07 02:51:18.278 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.8697394789579158 
2022-06-07 02:51:23.276 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.087218045112782 
2022-06-07 02:51:28.273 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1695171026156943 
2022-06-07 02:51:33.276 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1500250878073255 
2022-06-07 02:51:38.278 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0981472208312468 
2022-06-07 02:51:43.280 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0696044066099148 
2022-06-07 02:51:48.281 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.143430290872618 
2022-06-07 02:51:53.283 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1227454909819639 
2022-06-07 02:51:58.286 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0776553106212423 
2022-06-07 02:52:03.287 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1280120481927711 
2022-06-07 02:52:08.289 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0881763527054107 
2022-06-07 02:52:13.291 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.132132132132132 
2022-06-07 02:52:18.292 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1678356713426854 
2022-06-07 02:52:23.298 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2243365047571357 
2022-06-07 02:52:28.296 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.098294884653962 
2022-06-07 02:52:33.298 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1891891891891893 
2022-06-07 02:52:38.302 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1657486229344016 
2022-06-07 02:52:43.308 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1210447011551985 
2022-06-07 02:52:48.306 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0949238578680203 
2022-06-07 02:52:53.307 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.188877755511022 
2022-06-07 02:52:58.309 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.095691382765531 
2022-06-07 02:53:03.328 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2126063031515757 
2022-06-07 02:53:08.312 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1095477386934673 
2022-06-07 02:53:13.314 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1223671013039118 
2022-06-07 02:53:18.318 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1732598898347522 
2022-06-07 02:53:23.323 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.035571142284569 
2022-06-07 02:53:28.319 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.086258776328987 
2022-06-07 02:53:33.322 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1182364729458918 
2022-06-07 02:53:38.321 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1981981981981982 
2022-06-07 02:53:43.324 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1636636636636637 
2022-06-07 02:53:48.335 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1216216216216217 
2022-06-07 02:53:53.333 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1219879518072289 
2022-06-07 02:53:58.327 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0997993981945837 
2022-06-07 02:54:03.334 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1597396094141212 
2022-06-07 02:54:08.345 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1302605210420842 
2022-06-07 02:54:13.334 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0477386934673367 
2022-06-07 02:54:18.332 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1737160120845922 
2022-06-07 02:54:23.336 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0470706059088633 
2022-06-07 02:54:28.339 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0951427140711067 
2022-06-07 02:54:33.343 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1413533834586467 
2022-06-07 02:54:38.342 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1163490471414244 
2022-06-07 02:54:43.347 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1152304609218435 
2022-06-07 02:54:48.350 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.125751503006012 
2022-06-07 02:54:53.351 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.144578313253012 
2022-06-07 02:54:58.354 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.092685370741483 
2022-06-07 02:55:03.355 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1376192867905577 
2022-06-07 02:55:08.358 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1488721804511277 
2022-06-07 02:55:13.363 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.092685370741483 
2022-06-07 02:55:18.357 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1614844533600803 
2022-06-07 02:55:23.361 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1420710355177588 
2022-06-07 02:55:28.361 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1441441441441442 
2022-06-07 02:55:33.363 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2792792792792793 
2022-06-07 02:55:38.366 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0921382073109664 
2022-06-07 02:55:43.366 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2183274912368554 
2022-06-07 02:55:48.366 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.198193677872554 
2022-06-07 02:55:53.367 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1756756756756757 
2022-06-07 02:55:58.371 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.221 
2022-06-07 02:56:03.377 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2297297297297298 
2022-06-07 02:56:08.375 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1092184368737474 
2022-06-07 02:56:13.407 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2293853073463268 
2022-06-07 02:56:18.380 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1429290387518871 
2022-06-07 02:56:23.382 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1426426426426426 
2022-06-07 02:56:28.384 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1996996996996998 
2022-06-07 02:56:33.385 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1948897795591182 
2022-06-07 02:56:38.393 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.104 
2022-06-07 02:56:43.401 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2498748122183276 
2022-06-07 02:56:48.395 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1966884094330155 
2022-06-07 02:56:53.396 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.132132132132132 
2022-06-07 02:56:58.404 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1816816816816818 
2022-06-07 02:57:03.417 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1879699248120301 
2022-06-07 02:57:08.400 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2357906584130556 
2022-06-07 02:57:13.404 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: NaN